app/controllers/centros_controller.rb

SELECT "centros".* FROM "centros"
---
  def index
    @centros = Centro.all

SELECT  "centros".* FROM "centros" WHERE "centros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_centro
      @centro = Centro.find(params[:id])